### SERIES

In [1]:
import pandas as pd

In [4]:
data = [1,2,3,4,5]
series = pd.Series(data)

print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# Series from DICTIONARY
# the KEYS become the INDECES

data = {'a' : 1, 'b' : 2, 'c' : 3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

 ## DATAFRAME

In [11]:
data = {
    'Name': ['Krish', 'John', 'Jack'],
    'Age': [25, 30, 45],
    'City': ['Bangalora', 'New York', 'Florida']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalora
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [13]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Bangalora'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Florida']], dtype=object)

In [15]:
# create DataFrame from a list of dictionaries

data = [
    {'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'Fukurou', 'Age': 21, 'City': 'Hell'},
    {'Name': 'Kratos', 'Age': 1023, 'City': 'Hatred'},
    
]
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name   Age       City
0    Krish    32  Bangalore
1  Fukurou    21       Hell
2   Kratos  1023     Hatred
<class 'pandas.core.frame.DataFrame'>

In [17]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [19]:
df.iloc[0][1]

C:\Users\supev\AppData\Local\Temp\ipykernel_9896\2309508539.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

32

In [23]:
df['Name']

0      Krish
1    Fukurou
2     Kratos
Name: Name, dtype: object

In [24]:
df

      Name   Age       City
0    Krish    32  Bangalore
1  Fukurou    21       Hell
2   Kratos  1023     Hatred

In [26]:
# Accesing specified element

df.at[1, 'Age']

21

In [29]:
df.iat[2, 2]

'Hatred'

In [32]:
df['Salary'] = [2000, 3000, 4000]
df

      Name   Age       City  Salary
0    Krish    32  Bangalore    2000
1  Fukurou    21       Hell    3000
2   Kratos  1023     Hatred    4000

In [33]:
# Remove a column
df.drop('Salary', axis=1, inplace=True)
df

      Name   Age       City
0    Krish    32  Bangalore
1  Fukurou    21       Hell
2   Kratos  1023     Hatred

In [38]:
# Add age to the column
df['Age'] = df['Age'] + 1
df

      Name   Age       City
0    Krish    37  Bangalore
1  Fukurou    26       Hell
2   Kratos  1028     Hatred

In [40]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [41]:
df.describe()

               Age
count     3.000000
mean    363.666667
std     575.355832
min      26.000000
25%      31.500000
50%      37.000000
75%     532.500000
max    1028.000000